infoXchanger/app/views/scannedtokens/_previewShare.html.erb

      <br>
      <%= token.user.first_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]