app/views/tokens/mytokens.html.erb

    <strong>
      <%= token.user.first_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]