infoXchanger/app/controllers/scannedtokens_controller.rb

SELECT "scanned_tokens".* FROM "scanned_tokens" WHERE "scanned_tokens"."scanner_id" = 1
---
  def scanned
    @tokens = ScannedToken.where(scanner: current_user)

SELECT "scanned_tokens".* FROM "scanned_tokens" WHERE "scanned_tokens"."scanner_id" = 2
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def share
    @tokens = ScannedToken.where(scanner: current_user)
    @user = User.find(params[:id])

SELECT  "tokens".* FROM "tokens" WHERE "tokens"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def showLinkToken
    begin
      @token = Token.find(params[:id])

SELECT "scanned_tokens".* FROM "scanned_tokens" WHERE "scanned_tokens"."scanned_id" = 1
---
  def whoscannedme
    @tokens = ScannedToken.where(scanned: current_user)