infoXchanger/app/controllers/tokens_controller.rb

  def create
    info_str = ""
    @@info.each do |info|
      if params[info] != nil
        info_str << @@info.index(info).to_i.to_s << " "
      end
    end
    #info_str = "0 1 2 3 4 5 6 7 8 9 10 11 12"
    @user = current_user
    password = ''
    token_hash = SecureRandom.urlsafe_base64(18)
    begin
      @token = @user.tokens.create!(user: @user, password: password, info: info_str, token_hash: token_hash)
---
INSERT INTO "tokens" ("user_id", "info", "password", "created_at", "updated_at", "token_hash") VALUES (?, ?, ?, ?, ?, ?)

  def show
    begin
      @token = Token.find(params[:id])
---
SELECT  "tokens".* FROM "tokens" WHERE "tokens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def mytokens
  	@tokens = Token.where(user: current_user)
---
SELECT "tokens".* FROM "tokens" WHERE "tokens"."user_id" = 1

  def destroy
    @token = Token.find(params[:id])
    authorize! :destroy, @token
    @scan_token = ScannedToken.find_by(token_id: params[:id])
    if @scan_token
    	@scan_token.destroy
---
SELECT  "tokens".* FROM "tokens" WHERE "tokens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "scanned_tokens".* FROM "scanned_tokens" WHERE "scanned_tokens"."token_id" = ? LIMIT ?  [["token_id", 1], ["LIMIT", 1]]
DELETE FROM "tokens" WHERE "tokens"."id" = ?  [["id", 1]]