infoXchanger/app/controllers/users_controller.rb

  def show
    begin
      if !params[:t]
        @user = User.find(params[:id])
        @token = nil
      else
        @token = Token.find_by(token_hash: params[:t])
        if !@token
          raise ActiveRecord::RecordNotFound
        end
        @user = User.find(@token.user_id)
        @info = @@info
        if @user != current_user
          ScannedToken.create(scanner: current_user, scanned: @user, token: @token)
---
SELECT "users".* FROM "users" WHERE (((first_name IN ('federico','mascoma') OR last_name IN ('federico','mascoma') OR email IN ('federico','mascoma')) OR (first_name LIKE '%federico%' OR last_name LIKE '%federico%' OR email LIKE '%federico%')) OR (first_name LIKE '%mascoma%' OR last_name LIKE '%mascoma%' OR email LIKE '%mascoma%'))
SELECT  "tokens".* FROM "tokens" WHERE "tokens"."token_hash" = ? LIMIT ?  [["token_hash", "z6mKXD6XYNaxu-P8oPyZ23s0"], ["LIMIT", 1]]
SELECT  "tokens".* FROM "tokens" WHERE "tokens"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "scanned_tokens" ("scanner_id", "scanned_id", "token_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["scanner_id", 1], ["scanned_id", 3], ["token_id", 2], ["created_at", "2017-06-04 17:09:46.521106"], ["updated_at", "2017-06-04 17:09:46.521106"]]

  def edit
    begin
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    begin
      @user = User.find(params[:id])
    rescue ActiveRecord::RecordNotFound => e
      redirect_to root_path, flash: {:alert => 'No user found'} and return
    end
  	if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "born_on" = ?, "born_at" = ?, "telephone" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["born_on", "1995-01-01"], ["born_at", "roma"], ["telephone", "3271892321"], ["updated_at", "2017-06-04 17:11:55.633956"], ["id", 1]]

  def search
    if params[:query] != nil
      query = params[:query][0]
      min_len = 3
      if query.length < min_len
        redirect_to root_path, flash: {:alert => "You have to insert at least #{min_len} characters to search for a user"} and return
      else
        query = query.split(' ')
        @users = User.where('first_name IN (?) OR last_name IN (?) OR email IN (?)', query, query, query)
        query.each do |query|
          res = User.where('first_name LIKE ? OR last_name LIKE ? OR email LIKE ?', '%' + query + '%', '%' + query + '%', '%' + query + '%')
          @users = @users.or(res)
        end
        if !@users.empty?
---
SELECT "users".* FROM "users" WHERE (((first_name IN ('federico','mascoma') OR last_name IN ('federico','mascoma') OR email IN ('federico','mascoma')) OR (first_name LIKE '%federico%' OR last_name LIKE '%federico%' OR email LIKE '%federico%')) OR (first_name LIKE '%mascoma%' OR last_name LIKE '%mascoma%' OR email LIKE '%mascoma%'))
SELECT  1 AS one FROM "users" WHERE (((first_name IN ('federico','mascoma') OR last_name IN ('federico','mascoma') OR email IN ('federico','mascoma')) OR (first_name LIKE '%federico%' OR last_name LIKE '%federico%' OR email LIKE '%federico%')) OR (first_name LIKE '%mascoma%' OR last_name LIKE '%mascoma%' OR email LIKE '%mascoma%')) LIMIT ?  [["LIMIT", 1]]